app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
  def index
    @ingredients = Ingredient.all

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @ingredient = Ingredient.find(params[:id])

INSERT INTO "ingredients" ("created_at", "nombre", "precio", "unidad", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 22 Apr 2013 14:22:24 UTC +00:00], ["nombre", "Pollo"], ["precio", 5], ["unidad", "gr"], ["updated_at", Mon, 22 Apr 2013 14:22:24 UTC +00:00]]
---
  def create
    @ingredient = Ingredient.new(params[:ingredient])

    respond_to do |format|
      if @ingredient.save