app/controllers/plates_controller.rb

SELECT "plates".* FROM "plates"
---
  def index
    @plates = Plate.all

SELECT "plates".* FROM "plates" WHERE "plates"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @plate = Plate.find(params[:id])

SELECT "plates".* FROM "plates" WHERE "plates"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @plate = Plate.find(params[:id])

INSERT INTO "plates" ("calorias", "created_at", "nombre", "tipo", "updated_at") VALUES (?, ?, ?, ?, ?)  [["calorias", nil], ["created_at", Mon, 22 Apr 2013 14:30:18 UTC +00:00], ["nombre", ""], ["tipo", nil], ["updated_at", Mon, 22 Apr 2013 14:30:18 UTC +00:00]]
---
  def create
    @plate = Plate.new(params[:plate])
    count = 0
    if params[:plate][:horario] != nil
      params[:plate][:horario].each do |x|
        count += x.to_i
      end
    end
    @plate.horario = count

    respond_to do |format|
      if @plate.save

SELECT "plates".* FROM "plates" WHERE "plates"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "plates" SET "nombre" = 'Arroz con Pollo', "calorias" = 8, "updated_at" = '2013-04-22 14:30:41.503252' WHERE "plates"."id" = 1
---
  def update
    @plate = Plate.find(params[:id])
    count = 0
    if params[:plate][:horario] != nil
      params[:plate][:horario].each do |x|
        count += x.to_i
      end
    end
    respond_to do |format|
      if @plate.update_attributes(params[:plate])